РасчетныеЗадачиФинишNew/src/Documents/КадровоеИзменение/КадровоеИзменение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КадровоеИзменение</name>
  <basedOn>Document.ПриказОПриеме</basedOn>
  <basedOn>Document.КадровоеИзменение</basedOn>
  <registerRecords>InformationRegister.ПлановыеНачисления</registerRecords>
  <registerRecords>InformationRegister.ПлановыеОсновныеНачисления</registerRecords>
  <registerRecords>InformationRegister.Сотрудники</registerRecords>
  <registerRecords>InformationRegister.ПлановыеУдержания__</registerRecords>
  <registerRecords>InformationRegister.ЗначенияПоказателейРасчетаНачислений</registerRecords>
  <registerRecords>InformationRegister.ПлановыеДополнительныеНачисления</registerRecords>
  <registerRecords>InformationRegister.ПлановыеУдержания</registerRecords>
  <registerRecords>InformationRegister.ЗначенияПоказателейРасчетаУдержаний</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПриказОПриеме</types>
      <types>DocumentRef.КадровоеИзменение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВидыГрафиковРаботы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.ПоложительноеЧисло</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжаетДействовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОсновныеНачисления</name>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>DefinedType.ПоложительноеЧисло</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжаетДействовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.ПоложительноеЧисло</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеНачисления</name>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ДополнительныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>DefinedType.ПоложительноеЧисло</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Удержания</name>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.Удержания</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>DefinedType.ПоложительноеЧисло</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.ПоложительноеЧисло</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжаетДействовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РасчетныеЗадачиФинишNew/src/Documents/КадровоеИзменение/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриказОПриеме") Тогда

		ДокументОснование = ДанныеЗаполнения;
		ГрафикРаботы = ДанныеЗаполнения.ГрафикРаботы;
		Должность = ДанныеЗаполнения.Должность;
		Подразделение = ДанныеЗаполнения.Подразделение;
		ФизическоеЛицо = ДанныеЗаполнения.ФизическоеЛицо;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КадровоеИзменение") Тогда

		ДокументОснование = ДанныеЗаполнения;
		ГрафикРаботы = ДанныеЗаполнения.ГрафикРаботы;
		Должность = ДанныеЗаполнения.Должность;
		Подразделение = ДанныеЗаполнения.Подразделение;
		ФизическоеЛицо = ДанныеЗаполнения.ФизическоеЛицо;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ОсновныеНачисления.ВидРасчета,
//		|	ОсновныеНачисления.Размер
//		|ПОМЕСТИТЬ ВТОсновныеНачисленияДокумент
//		|ИЗ
//		|	&ОсновныеНачисления КАК ОсновныеНачисления
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ПлановыеОсновныеНачисленияСрезПоследних.ВидРасчета,
//		|	1 Как Номер
//		|ПОМЕСТИТЬ ВТОсновныеНачисления
//		|ИЗ
//		|	РегистрСведений.ПлановыеОсновныеНачисления.СрезПоследних(&Период, ФизическоеЛицо = &ФизическоеЛицо
//		|	И ВидРасчета.ЗачетОтработанногоВремени) КАК ПлановыеОсновныеНачисленияСрезПоследних
//		|ГДЕ
//		|	ПлановыеОсновныеНачисленияСрезПоследних.Размер > 0
//		|
//		|ОБЪЕДИНИТЬ ВСЕ
//		|
//		|ВЫБРАТЬ
//		|	ВТОсновныеНачисленияДокумент.ВидРасчета,
//		|	1
//		|ИЗ
//		|	ВТОсновныеНачисленияДокумент КАК ВТОсновныеНачисленияДокумент
//		|ГДЕ
//		|	ВТОсновныеНачисленияДокумент.Размер = 0 И ВТОсновныеНачисленияДокумент.ВидРасчета.ЗачетОтработанногоВремени
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ВТОсновныеНачисления.ВидРасчета КАК ВидРасчета,
//		|	Количество(ВТОсновныеНачисления.Номер) КАК КоличествоВидовРасчетов
//		|ИЗ
//		|	ВТОсновныеНачисления КАК ВТОсновныеНачисления
//		|СГРУППИРОВАТЬ ПО
//		|	ВТОсновныеНачисления.ВидРасчета
//		|ИМЕЮЩИЕ
//		|	Не КОЛИЧЕСТВО(ВТОсновныеНачисления.Номер) = 1";
//	
//	Запрос.УстановитьПараметр("ОсновныеНачисления",ОсновныеНачисления);
//	Запрос.УстановитьПараметр("Период",ДатаСобытия);
//	Запрос.УстановитьПараметр("ФизическоеЛицо",ФизическоеЛицо);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//			
//			Отказ = Истина;
//			
//			Сообщение = Новый СообщениеПользователю;
//			Сообщение.Текст = "Для сотрудника нужно указать только (хотя бы) одно начисления, учитывающее отработанное время!";
//			Сообщение.Сообщить();
//			
//	КонецЦикла;
	
КонецПроцедуры
